Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

source: Also, any file containing null in the first block is considered a binary file.
es_es: También, cualquier fichero conteniendo caracteres nulos en el primer bloque son considerados ficheros binarios.

source: If C<-T> or C<-B> is used on a filehandle, the current IO buffer is examined rather than the first block.
es_es: Si C<-T> o C<-B> se usan con un manejador, el buffer actual de IO es examinado en vez del primer bloque.

source: Both C<-T> and C<-B> return true on a null file, or a file at EOF when testing a filehandle.
es_es: Ambos C<-T> y C<-B> devuelven verdadero en un fichero nulo o en un fichero en el EOF (fin de fichero) cuando se testee un manejador.

source: Because you have to read a file to do the C<-T> test, on most occasions you want to use a C<-f> against the file first, as in C<next unless -f $file && -T $file>.
es_es: Debido a que tiene que leer el fichero para hacer el test C<-T>, en la mayoría de las ocasiones querrá usar primero C<-f>, como enC<next unless -f $fichero && -T $fichero>.

source: If any of the file tests (or either the C<stat> or C<lstat> operators) are given the special filehandle consisting of a solitary underline, then the stat structure of the previous file test (or stat operator) is used, saving a system call.
es_es: Si a cualquiera de los test de fichero (o los operadores C<stat> o C<lstat>) se les da el manejador de fichero especial consistente en un solitario subrayado (guión bajo), entonces se usa la estructura stat del fichero del test anterior (u operador stat), ahorrando una llamada del sistema.

source: (This doesn't work with C<-t>, and you need to remember that lstat() and C<-l> will leave values in the stat structure for the symbolic link, not the real file.) (Also, if the stat buffer was filled by an C<lstat> call, C<-T> and C<-B> will reset it with the results of C<stat _>).
es_es: (Esto no funciona con C<-t> y necesita recordar que lstat() y C<-l> dejarán valores en la estructura stat para el enlace simbólico, no el fichero real). (También, si el buffer stat se rellenó con una llamada C<lstat>, C<-T> y C<-B> serán reinicializados con los resultados de C<stat _>).

# print "Can do. " if -r $a || -w _ || -x _;
source: print "Can do.\n" if -r $a || -w _ || -x _;
es_es: print "Puedo hacerlo.\n" if -r $a || -w _ || -x _;

source: stat($filename);
es_es: stat($nombre_de_fichero);

# print "Readable " if -r _;
source: print "Readable\n" if -r _;
es_es: print "Leíble\n" if -r _;

# print "Writable " if -w _;
source: print "Writable\n" if -w _;
es_es: print "Escribible\n" if -w _;

# print "Executable " if -x _;
source: print "Executable\n" if -x _;
es_es: print "Ejecutable\n" if -x _;

# print "Text " if -T _;
source: print "Text\n" if -T _;
es_es: print "Texto\n" if -T _;

# print "Binary " if -B _;
source: print "Binary\n" if -B _;
es_es: print "Binario\n" if -B _;

source: =item abs VALUE X<abs> X<absolute>
es_es: =item abs VALOR X<abs> X<absoluto>

source: Returns the absolute value of its argument.
es_es: Devuelve el valor absoluto del argumento.

source: If VALUE is omitted, uses C<$_>.
es_es: Si se omite VALOR, se usa C<$_>.

source: =item accept NEWSOCKET,GENERICSOCKET X<accept>
es_es: =item accept NUEVOSOCKET,SOCKETGENÉRICO X<accept>

source: Accepts an incoming socket connect, just as the accept(2) system call does.
es_es: Acepta un conexión socket entrante, como lo hace la llamada del sistema accept(2).

source: Returns the packed address if it succeeded, false otherwise.
es_es: Devuelve la dirección empaquetada si ha tenido éxito, de lo contrario, falso.

source: See the example in L<perlipc/"Sockets: Client/Server Communication">.
es_es: Ver el ejemplo en L<perlipc/"Sockets: Comunicación Cliente/Servidor">.

source: On systems that support a close-on-exec flag on files, the flag will be set for the newly opened file descriptor, as determined by the value of $^F.
es_es: En sistemas que soportan la bandera cerrar-en-ejecución sobre ficheros, la bandera será puesta para el nuevo descriptor de fichero abierto, determinado por el valor de $^F.

source: See L<perlvar/$^F>.
es_es: Ver L<perlvar/$^F>.

source: =item alarm SECONDS X<alarm> X<SIGALRM> X<timer>
es_es: =item alarm SEGUNDOS X<alarm> X<SIGALRM> X<timer> X<temporizador>

source: Arranges to have a SIGALRM delivered to this process after the specified number of wallclock seconds has elapsed.
es_es: Ordena mandar una señal SIGALRM al proceso actual después de que haya pasado el número de segundos especificados.

source: If SECONDS is not specified, the value stored in C<$_> is used.
es_es: Si no se ha especificado SEGUNDOS, se usará el valor almacenado en C<$_>.

source: (On some machines, unfortunately, the elapsed time may be up to one second less or more than you specified because of how seconds are counted, and process scheduling may delay the delivery of the signal even further.)
es_es: (En algunas máquinas, desafortunadamente, el tiempo transcurrido puede ser hasta un segundo más o menos del especificado debido a cómo los segundos son contados, y la planificación de procesos pueden retrasar la entrega de la señal incluso más).

source: Only one timer may be counting at once.
es_es: Sólo un temporizador puede estar contando cada vez.

source: Each call disables the previous timer, and an argument of C<0> may be supplied to cancel the previous timer without starting a new one.
es_es: Cada llamada desactiva el temporizador anterior, y se puede indicar un argumento C<0> para cancelar el temporizador anterior sin empezar uno nuevo.

source: The returned value is the amount of time remaining on the previous timer.
es_es: El valor devuelto es la cantidad de tiempo restante del temporizador anterior.

source: For delays of finer granularity than one second, you may use Perl's four-argument version of select() leaving the first three arguments undefined, or you might be able to use the C<syscall> interface to access setitimer(2) if your system supports it.
es_es: Para lapsos más finos que un segundo, puede usar la versión de Perl de cuatro argumentos de select() dejando los 3 primeros argumentos indefinidos, o puede usar la interface C<syscall> para acceder a setitimer(2) si su sistema lo soporta.

source: The Time::HiRes module (from CPAN, and starting from Perl 5.8 part of the standard distribution) may also prove useful.
es_es: El módulo Time::HiRes (de CPAN, y siendo desde Perl 5.8 parte de la distribución estándar) puede también ser útil.

source: It is usually a mistake to intermix C<alarm> and C<sleep> calls.
es_es: Normalmente es un fallo entremezclar llamadas a C<alarm> y C<sleep>.

source: (C<sleep> may be internally implemented in your system with C<alarm>)
es_es: (C<sleep> puede internamente estar implementado en su sistema con C<alarm>)

source: If you want to use C<alarm> to time out a system call you need to use an C<eval>/C<die> pair.
es_es: Si quiere usar C<alarm> controlar la duración de una llamada del sistema necesita una pareja C<eval>/C<die>.

source: You can't rely on the alarm causing the system call to fail with C<$!> set to C<EINTR> because Perl sets up signal handlers to restart system calls on some systems.
es_es: No puede confiar que la alarma que llama a la llamada del sistema falle y ponga C<$!> a C<EINTR> porque Perl activa manejadores de señal para reiniciar llamadas al sistema en algunos sistemas.

source: Using C<eval>/C<die> always works, modulo the caveats given in L<perlipc/"Signals">.
es_es: Usando C<eval>/C<die> siempre funciona, teniendo en cuenta las advertencias dadas en L<perlipc/"Señales">.

source: eval { local $SIG{ALRM} = sub { die "alarm\n" }; # NB: \n required alarm $timeout; $nread = sysread SOCKET, $buffer, $size; alarm 0;
es_es: eval { local $SIG{ALRM} = sub { die "alarma\n" }; # NB: se requiere \n alarm $timeout; $nread = sysread SOCKET, $buffer, $size; alarm 0;

# if ($@) { die unless $@ eq "alarm "; # propagate unexpected errors
source: if ($@) { die unless $@ eq "alarm\n"; # propagate unexpected errors
es_es: if ($@) { die unless $@ eq "alarma\n"; # propagar errores inesperados

source: # timed out
es_es: # tiempo agotado

source: # didn't
es_es: # no se agotó el tiempo

source: For more information see L<perlipc>.
es_es: Para más información ver L<perlipc>.

source: =item atan2 Y,X X<atan2> X<arctangent> X<tan> X<tangent>
es_es: =item atan2 Y,X X<atan2> X<arcotangente> X<tan> X<tangente>

source: Returns the arctangent of Y/X in the range -PI to PI.
es_es: Devuelve el arcotangente de Y/X en el rango -PI a PI.

source: For the tangent operation, you may use the C<Math::Trig::tan> function, or use the familiar relation:
es_es: Para la operación tangente, puede usar la función C<Math::Trig::tan>, o usar la conocidad relación:

source: Note that atan2(0, 0) is not well-defined.
es_es: Note que atan2(0, 0) no está bien definida.

source: =item bind SOCKET,NAME X<bind>
es_es: =item bind SOCKET,NOMBRE X<bind>

source: Binds a network address to a socket, just as the bind system call does.
es_es: Enlaza una dirección de red a un socket, como lo hace la llamada del sistema bind.

source: Returns true if it succeeded, false otherwise.
es_es: Devuelve verdadero si tiene éxito; de lo contrario, falso.

source: NAME should be a packed address of the appropriate type for the socket.
es_es: NOMBRE debe ser una dirección empaquetada del tipo apropiado para el socket.

source: See the examples in L<perlipc/"Sockets: Client/Server Communication">.
es_es: Ver los ejemplos en L<perlipc/"Sockets: Comunicación Cliente/Servidor">.

source: =item binmode FILEHANDLE, LAYER X<binmode> X<binary> X<text> X<DOS> X<Windows>
es_es: =item binmode MANEJADOR, CAPA X<binmode> X<binario> X<texto> X<DOS> X<Windows>

source: =item binmode FILEHANDLE
es_es: =item binmode MANEJADOR

source: Arranges for FILEHANDLE to be read or written in "binary" or "text" mode on systems where the run-time libraries distinguish between binary and text files.
es_es: Ordena que el modo de lectura o escritura para el MANEJADOR sea en "binario" o "texto" en sistemas donde las bibliotecas en tiempo de ejecución distingan entre ficheros binarios y de texto.

source: If FILEHANDLE is an expression, the value is taken as the name of the filehandle.
es_es: Si MANEJADOR es una expresión, el valor es tomado como el nombre del manejador.

source: Returns true on success, otherwise it returns C<undef> and sets C<$!> (errno).
es_es: Devuelve verdadero en éxito; de lo contrario devuelve C<undef> y pone C<$!> (errno).

source: On some systems (in general, DOS and Windows-based systems) binmode() is necessary when you're not working with a text file.
es_es: En algunos sistemas (en general, sistemas basados en DOS y Windows) binmode() es necesario cuando no esté trabajando con un fichero de texto.

source: For the sake of portability it is a good idea to always use it when appropriate, and to never use it when it isn't appropriate.
es_es: Para una mejor portabilidad es una buena idea siempre usarlo cuando sea apropiado, y nunca usarlo cuando no sea apropiado.

source: Also, people can set their I/O to be by default UTF-8 encoded Unicode, not bytes.
es_es: También, el personal puede poner su I/O para que sea codificado en Unicode UTF-8, y no bytes.

source: In other words: regardless of platform, use binmode() on binary data, like for example images.
es_es: En otras palabras: indiferentemente de la plataforma, use binmode() en datos binarios, como por ejemplo imágenes.

source: If LAYER is present it is a single string, but may contain multiple directives.
es_es: Si CAPA está presente es un único string, pero puede contener múltiples directivas.

source: The directives alter the behaviour of the file handle.
es_es: Las directivas alteran el comportamiento del manejador del fichero.

source: When LAYER is present using binmode on text file makes sense.
es_es: Tiene sentido usar binmode sobre un fichero de texto cuando CAPA está presente.

source: If LAYER is omitted or specified as C<:raw> the filehandle is made suitable for passing binary data.
es_es: Si se omite CAPA o se especifica como C<:raw> el manejador se prepara para pasar datos binarios.

source: This includes turning off possible CRLF translation and marking it as bytes (as opposed to Unicode characters).
es_es: Esto incluye desactivar posibles traducciones CRLF y marcarlas como bytes (como opuesto a los caracteres Unicode).

source: Note that, despite what may be implied in I<"Programming Perl"> (the Camel) or elsewhere, C<:raw> is I<not> the simply inverse of C<:crlf> -- other layers which would affect binary nature of the stream are I<also> disabled.
es_es: Note que, a pesar de estar implícito en I<"Programming Perl"> (el dromedario) o en otra lugar, C<:raw> I<no> es el inverso simple de C<:crlf> -- otras capas que pudieran afectar la naturaleza binaria del flujo son I<también> desactivadas.

source: See L<PerlIO>, L<perlrun> and the discussion about the PERLIO environment variable.
es_es: Ver L<PerlIO>, L<perlrun> y la discusión sobre la variable de entorno PERLIO.

source: The C<:bytes>, C<:crlf>, and C<:utf8>, and any other directives of the form C<:...>, are called I/O I<layers>.
es_es: C<:bytes>, C<:crlf> y C<:utf8>, y cualquier otra directiva de la forma C<:...> se llaman I<capas> I/O.

source: The C<open> pragma can be used to establish default I/O layers.
es_es: El pragma C<open> puede ser usado para establecer las capas I/O por defecto.

source: See L<open>.
es_es: Ver L<open>.

source: I<The LAYER parameter of the binmode() function is described as "DISCIPLINE" in "Programming Perl, 3rd Edition".
es_es: I<El parámetro CAPA de la función binmode() se describe como "DISCIPLINA" en "Programming Perl, 3rd Edition".

source: However, since the publishing of this book, by many known as "Camel III", the consensus of the naming of this functionality has moved from "discipline" to "layer".
es_es: Sin embargo, desde la publicación de este libro, conocido por muchos como "Camel III", el consenso sobre el nombre de esta funcionalidad se ha movido desde "disciplina" a "capa".

source: All documentation of this version of Perl therefore refers to "layers" rather than to "disciplines".
es_es: Toda documentación desde esta versión de Perl se refiere a "capas" en vez de a "disciplinas".

source: Now back to the regularly scheduled documentation...>
es_es: Ahora volvamos a la documentación normal...>

source: To mark FILEHANDLE as UTF-8, use C<:utf8>.
es_es: Para marcar MANEJADOR como UTF-8, use C<:utf8>.

source: In general, binmode() should be called after open() but before any I/O is done on the filehandle.
es_es: En general, binmode() debe ser llamada después de open() pero antes de que cualquier I/O se realice sobre el manejador.

source: Calling binmode() will normally flush any pending buffered output data (and perhaps pending input data) on the handle.
es_es: Llamando binmode() normalmente vaciará cualquier dato pendiente almacenado en la salida (y quizás datos pendientes a la entrada) del manejador.

source: An exception to this is the C<:encoding> layer that changes the default character encoding of the handle, see L<open>.
es_es: Una excepción a esto es la capa C<:encoding> que cambia la codificación por defecto del manejador; ver L<open>.

source: The C<:encoding> layer sometimes needs to be called in mid-stream, and it doesn't flush the stream.
es_es: La capa C<:encoding> algunas veces necesita ser llamada en mitad del flujo de datos y no lo vacía.

source: The C<:encoding> also implicitly pushes on top of itself the C<:utf8> layer because internally Perl will operate on UTF-8 encoded Unicode characters.
es_es: C<:encoding> también se coloca, implícitamente, por encima de la capa C<:utf8> porque Perl internamente operará con caracteres Unicode codificados en UTF-8.

source: The operating system, device drivers, C libraries, and Perl run-time system all work together to let the programmer treat a single character (C<\n>) as the line terminator, irrespective of the external representation.
es_es: El sistema operativo, controladores de dispositivos, bibliotecas C y Perl en tiempo de ejecución trabajan al unísono para permitirle al programador tratar un simple carácter (C<\n>) como el final de línea, independientemente de su representación externa.

source: On many operating systems, the native text file representation matches the internal representation, but on some platforms the external representation of C<\n> is made up of more than one character.
es_es: En muchos sistemas operativos, la representación nativa de un fichero texto coincide con su representación interna, pero en algunas plataformas la representación externa de C<\n> se realiza con más de un carácter.

source: Mac OS, all variants of Unix, and Stream_LF files on VMS use a single character to end each line in the external representation of text (even though that single character is CARRIAGE RETURN on Mac OS and LINE FEED on Unix and most VMS files).
es_es: Mac OS, todas las variantes de Unix y los ficheros Stream_LF sobre VMS usan un único carácter al final de cada línea en la representación externa del texto (incluso si el carácter único es un RETORNO DE CARRO en Mac OS y un AVANCE DE LÍNEA en Unix y la mayor parte de los ficheros VMS).

source: In other systems like OS/2, DOS and the various flavors of MS-Windows your program sees a C<\n> as a simple C<\cJ>, but what's stored in text files are the two characters C<\cM\cJ>.
es_es: En otros sistemas como OS/2, DOS y los distintos sabores de MS-Windows tu programa vee un C<\n> como un simple C<\cJ>, pero es almacenado en los ficheros de texto como los dos caracteres C<\cM\cJ>.

source: That means that, if you don't use binmode() on these systems, C<\cM\cJ> sequences on disk will be converted to C<\n> on input, and any C<\n> in your program will be converted back to C<\cM\cJ> on output.
es_es: Esto significa que, si no usas binmode() en estos sistemas, las secuencias C<\cM\cJ> en disco serán convertidas a C<\n> en la entrada y cualquier C<\n> en tu programa será convertido de nuevo en C<\cM\cJ> en la salida.

source: This is what you want for text files, but it can be disastrous for binary files.
es_es: Esto es lo que quiere para ficheros de texto, pero puede ser desastroso para ficheros binarios.

source: Another consequence of using binmode() (on some systems) is that special end-of-file markers will be seen as part of the data stream.
es_es: Otra consecuencia de usar binmode() (en algunos sistemas) es que las marcas especiales de fin-de-fichero serán vistas como parte del flujo de datos.

source: For systems from the Microsoft family this means that if your binary data contains C<\cZ>, the I/O subsystem will regard it as the end of the file, unless you use binmode().
es_es: Para los sistemas de la familia Microsoft esto significa que si sus datos binarios contienenC<\cZ>, el subsistema I/O lo considerarán como el fin del fichero, a menos que use binmode().

source: binmode() is not only important for readline() and print() operations, but also when using read(), seek(), sysread(), syswrite() and tell() (see L<perlport> for more details).
es_es: binmode() no sólo es importante para las operaciones readline() y print(), sino también cuando se usan read(), seek(), sysread(), syswrite() y tell() (ver L<perlport> para más detalles).

source: See the C<$/> and C<$\> variables in L<perlvar> for how to manually set your input and output line-termination sequences.
es_es: Ver las variables C<$/> y C<$\> en L<perlvar> para cómo poner manualmente sus secuencias de fin de línea en su entrada y salida.

source: =item bless REF,CLASSNAME X<bless>
es_es: =item bless REF,NOMBRECLASE X<bless>

source: This function tells the thingy referenced by REF that it is now an object in the CLASSNAME package.
es_es: Esta función dice que la cosa referenciada por REF es ahora un objeto del paquete NOMBRECLASE (I<bless> es bendición en inglés, que se podría traducir mejor por bautizar, en el sentido de 'dar un nombre' al objeto).

source: If CLASSNAME is omitted, the current package is used.
es_es: Si se omite NOMBRECLASE, se usa el paquete actual.

source: Because a C<bless> is often the last thing in a constructor, it returns the reference for convenience.
es_es: Como un C<bless> a menudo es la última cosa de un constructor, devuelve la referencia por conveniencia.

source: Always use the two-argument version if a derived class might inherit the function doing the blessing.
es_es: Siempre usar la versión de dos argumentos si una clase derivada puede heredar la función con un nuevo bautizo.

source: See L<perltoot> and L<perlobj> for more about the blessing (and blessings) of objects.
es_es: Ver L<perltoot> y L<perlobj> para saber más sobre bautizos (y bautizar) de objetos.

source: Consider always blessing objects in CLASSNAMEs that are mixed case.
es_es: Considerar siempre bautizar objetos de NOMBRECLASE que mezcle mayúsculas y minúsculas.

source: Namespaces with all lowercase names are considered reserved for Perl pragmata.
es_es: El espacio de nombres en minúsculas está considerado reservado para los pragmas de Perl.

source: Builtin types have all uppercase names.
es_es: Los tipos incluidos tienen todos sus nombres en mayúscula.

source: To prevent confusion, you may wish to avoid such package names as well.
es_es: Para evitar confusiones, evite nombres de paquete también de esta manera.

source: Make sure that CLASSNAME is a true value.
es_es: Asegúrese de que NOMBRECLASE es un valor verdadero.

source: See L<perlmod/"Perl Modules">.
es_es: Ver L<perlmod/"Módulos Perl">.

source: =item caller EXPR X<caller> X<call stack> X<stack> X<stack trace>
es_es: =item caller EXPR X<caller> X<call stack> X<stack> X<stack trace> X<pila> X<pila de llamadas>

source: Returns the context of the current subroutine call.
es_es: Devuelve el contexto de la llamada a la subrutina actual.

source: In scalar context, returns the caller's package name if there is a caller, that is, if we're in a subroutine or C<eval> or C<require>, and the undefined value otherwise.
es_es: En contexto escalar, devuelve el nombre del paquete del llamante si aquel es un llamante, es decir, si estamos en una subrutina, C<eval> o C<require>, y el valor indefinido en otro caso.

source: In list context, returns
es_es: En contexto lista, devuelve

source: ($package, $filename, $line) = caller;
es_es: ($paquete, $nombre_fichero, $linea) = caller;

source: With EXPR, it returns some extra information that the debugger uses to print a stack trace.
es_es: Con EXPR, devuelve alguna información extra que el depurador usa para imprimir un rastreo de la pila.

source: The value of EXPR indicates how many call frames to go back before the current one.
es_es: El valor de EXPR indica cuántos marcos de llamada se ha de retroceder antes del actual.

source: ($package, $filename, $line, $subroutine, $hasargs,
es_es: ($paquete, $fichero, $linea, $subritina, $hasargs,

source: Here $subroutine may be C<(eval)> if the frame is not a subroutine call, but an C<eval>.
es_es: Aquí, $subrutina puede ser C<(eval)> si el marco de llamada no es una llamada a una subrutina, sino un C<eval>.

source: In such a case additional elements $evaltext and C<$is_require> are set: C<$is_require> is true if the frame is created by a C<require> or C<use> statement, $evaltext contains the text of the C<eval EXPR> statement.
es_es: En tal caso, se añaden los nuevos elementos $evaltext y C<$is_require>: C<$is_require> es verdadero si el marco es creado por una sentencia C<require> o C<use>, $evaltext contiene el texto de la sentencia C<eval EXPR>.
